# Shell & terminal
brew "atuin"
brew "autojump"
brew "direnv"
brew "starship"
brew "tmux"

# Search & navigation
brew "fd"
brew "fzf"
brew "ripgrep"

# Languages & runtimes
brew "go"
brew "goenv"
brew "jenv"
brew "node"
brew "pyenv"
brew "pyenv-virtualenv"

# Version managers
brew "asdf"

# Containers & Kubernetes
brew "colima", restart_service: :changed
brew "docker"
brew "kubernetes-cli"
brew "kubectx"

# Databases
brew "libmemcached"
brew "mysql-client"
brew "postgresql@14"

# Dev tools
brew "duti"
brew "glab"
brew "gnupg"
brew "graphviz"
brew "icu4c@76"
brew "neovim"

# GUI apps
cask "ghostty"
cask "gcloud-cli"
cask "visual-studio-code"
cask "zed"

# Fonts
cask "font-martian-mono-nerd-font"
